import 'package:flutter/material.dart';

List<Map> dataList = [
  {
    'name': "मकै खेति\n प्रबिधि ",
    'nam': "मकै खेति प्रबिधि ",
    'imagepath': "assets/maize.png",
    'description':
        'मकै खेती नेपालमा एक महत्वपूर्ण कृषि उत्पादन हो। यसले देशका अन्य क्षेत्रहरूमा बढी पनि कृषि उत्पादनमा सहयोग गरेको छ। मकैले नेपाली जनतालाई अत्यधिक मानसिक तथा शारीरिक रूपमा शक्ति प्रदान गर्दछ अनि यसले आहार सुरक्षा तथा आर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।मकैलाई नेपालमा बालीका रुपमा पनि चिरिएको छ। मकै उत्पादन र सेवा समेत नेपालको अर्थात्मक विकासमा महत्वपूर्ण भूमिका खेल्दछ। मकैको खेतीले आर्थिक उत्पादनमा सहयोग गर्दै नेपाली किसानहरूलाई आर्थिक रूपमा समृद्धि प्रदान गर्दछ।मकै खेती को विस्तृत विकास र समृद्धि लागि, अग्रणी तथा विज्ञानका अनुसन्धान गर्नुपर्ने छ। यसको अर्थव्यवस्थामा सकारात्मक परिणाम प्राप्त गर्न विभिन्न अध्ययनहरू, तात्त्विक अनुसन्धान, तथा कृषि विकासका लागि नवीनतम प्रविधि तथा उत्पादन प्रणालीहरूको प्रयोग गरिनुपर्छ। नेपालमा मकै खेतीलाई सुधार्न र संवेदनशील बनाउन कृषि अनुसन्धानको महत्वपूर्ण भूमिका छ।मकै खेती नेपालको आर्थिक तथा सामाजिक विकासमा महत्वपूर्ण भूमिका खेल्छ। यसले नेपालको आर्थिक विकासमा महत्वपूर्ण योगदान प्रदान गर्दछ, जसले लाखौं नेपालीहरूलाई आर्थिक रूपमा सकारात्मक परिणाम प्राप्त गर्दछ।मकैलाई नेपालमा बालीका रुपमा पनि चिरिएको छ। मकै उत्पादन र सेवा समेत नेपालको अर्थात्मक विकासमा महत्वपूर्ण भूमिका खेल्दछ। मकैको खेतीले आर्थिक उत्पादनमा सहयोग गर्दै नेपाली किसानहरूलाई आर्थिक रूपमा समृद्धि प्रदान गर्दछ।',
  },
  {
    'name': "गहु खेति \n प्रबिधि ",
    'nam': "गहु खेति प्रबिधि ",
    'imagepath': "assets/wheat.png",
    'description': 'गहु कृषि नेपालमा एक महत्वपूर्ण खेती हो। यसले नेपालको कृषि सेक्टरमा महत्वपूर्ण भूमिका खेल्दछ र देशको आर्थिक विकासमा सहायक हुने छ। गहु उत्पादन गर्दा, नेपाली किसानहरूले नैतिक तथा आर्थिक रूपमा उनलाई प्राप्त गरेको आय तथा अन्य सामाजिक सुविधाहरूमा वृद्धि गराउँछन्।गहुले नेपाली लोकसभाको मुख्य आजीविका स्रोतमा एक महत्वपूर्ण भूमिका खेल्छ। यसले नेपाली किसानहरूलाई आर्थिक रूपमा समृद्धि प्रदान गर्दछ र देशको अर्थात्मक विकासमा महत्वपूर्ण योगदान प्रदान गर्दछ।गहु की खेती के लिए सही मिट्टी, पानी, उर्वरक और बीज का चयन महत्वपूर्ण होता है। उत्पादनता को बढ़ाने और किसानों को नई तकनीकों के साथ अवगत कराने के लिए सरकारी योजनाओं और अन्य संगठनों के अध्ययन और अनुसंधान की आवश्यकता होती है।गहु की खेती नेपाल में कई सामाजिक, आर्थिक और पर्यावरणीय लाभ प्रदान करती है। यह न केवल भोजन की सुरक्षा और आर्थिक स्थिरता को सुनिश्चित करती है, बल्कि किसानों को निर्धारित आय प्रदान करने के साथ-साथ कृषि संबंधी अन्य उत्पादों की आपूर्ति में भी मदद करती है। इसके अलावा, गहु की खेती नेपाली किसानों के लिए नई रोजगार के अवसर प्रदान करती है, जो प्रगति के लिए एक महत्वपूर्ण कदम है।अंत में, गहु की खेती नेपाल के लिए एक महत्वपूर्ण स्रोत है जो उसके आर्थिक और सामाजिक विकास में महत्वपूर्ण भूमिका निभाता ह।',
  },
  {
    'name': "हाइब्रिड मकै\n  प्रबिधि",
    'nam': "हाइब्रिड मकै प्रबिधि",
    'imagepath': "assets/maize1.png",
    'description': 'हाइब्रिड मकै कृषि नेपालमा एक नयाँ और प्रौद्योगिकी पूर्ण खेती पद्धति हो। यसले मकै की उत्पादकता बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, और पर्यावरणीय संरक्षण को ध्यान में रखने में मदद करता है। हाइब्रिड मकै कृषि के उदाहरणों में उच्च उत्पादकता और उत्तम गुणवत्ता वाले बीजों का उपयोग किया जाता है, जो कि परिणामस्वरूप अधिक उत्पादक फसलों का निर्माण करने में मदद करता है।हाइब्रिड मकै कृषि नेपाली किसानों को उन्नत तकनीकी ज्ञान, उन्नत बीज, और समृद्धि की अवसर प्रदान करती है। यह किसानों को अधिक उत्पादक फसलों का उत्पादन करने में सहायक होती है और उन्हें अधिक मुनाफा कमाने में मदद करती है। इसके अलावा, यह पर्यावरण के साथ भी अधिक संवेदनशील है, क्योंकि यह कम जल की आवश्यकता होती है और कृषि उत्पादन में कीट-रोग प्रबंधन में मदद करता है।हाइब्रिड मकै कृषि के लाभों में निम्नलिखित शामिल हो सकते हैं:उत्पादकता बढ़ाएं: हाइब्रिड मकै के उत्पादन से उत्पन्न फसलें अधिक संदृश्य होती हैं, जिससे किसानों का मुनाफा बढ़ता है।उच्च गुणवत्ता: हाइब्रिड मकै के बीजों से उत्पन्न फसलें उच्च गुणवत्ता की होती हैं, जिससे उत्पादित अन्न की गुणवत्ता भी बढ़ती है।पर्यावरणीय संरक्षण: हाइब्रिड मकै कृषि तकनीक ज्ञान का उपयोग करती है, जिससे जल संसाधन का उपयोग कम होता है और जल की संरक्षा होती है।आर्थिक विकास: हाइब्रिड मकै कृषि से किसानों की आय में वृद्धि होती है, जो कि उनके आर्थिक विकास को सहायक होती है।सम्पूर्ण रूपमा, हाइब्रिड मक',
  },
  {
    'name': "फापर खेति\n  प्रबिधि ",
    'nam': "फापर खेति प्रबिधि ",
    'imagepath': "assets/fapar.png",
    'description': 'फापर कृषि नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपालको कृषि सेक्टरमा महत्वपूर्ण भूमिका खेल्दछ र देशको आर्थिक विकासमा सहायक हुने छ। फापर उत्पादन गर्दा, नेपाली किसानहरूले नैतिक तथा आर्थिक रूपमा उनलाई प्राप्त गरेको आय तथा अन्य सामाजिक सुविधाहरूमा वृद्धि गराउँछन्।फापर की खेती के लिए सही मिट्टी, पानी, उर्वरक और बीज का चयन महत्वपूर्ण होता है। यह कृषि उत्पादन के लिए महत्वपूर्ण फसल मानी जाती है जो नेपाली किसानों को उत्पादनता में वृद्धि दिलाने में मदद करती है। फापर की खेती नेपाल में विभिन्न भागों में की जाती है और यह अनेक प्रकार की आधुनिक तकनीकों का उपयोग करती है, जिससे किसानों को अधिक मुनाफा कमाने में मदद मिलती है।फापर की खेती नेपाल में कृषि उत्पादन के लिए महत्वपूर्ण स्रोत मानी जाती है जो उत्पादन और आर्थिक स्थिरता को सुनिश्चित करती है। यह न केवल भोजन की सुरक्षा और आर्थिक स्थिरता को सुनिश्चित करती है, बल्कि किसानों को निर्धारित आय प्रदान करने के साथ-साथ कृषि संबंधी अन्य उत्पादों की आपूर्ति में भी मदद करती है। इसके अलावा, फापर की खेती नेपाली किसानों के लिए नई रोजगार के अवसर प्रदान करती है, जो प्रगति के लिए एक महत्वपूर्ण कदम है। फापर की खेती नेपाल के लिए एक महत्वपूर्ण स्रोत है जो उसके आर्थिक और सामाजिक विकास में महत्वपूर्ण भूमिका निभाता ह।',
  },
  {
    'name': "कोदो खेति\n  प्रबिधि ",
    'nam': "कोदो खेति प्रबिधि ",
    'imagepath': "assets/millet2.png",
    'description': 'कोदो खेती नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपालको कृषि सेक्टरमा महत्वपूर्ण भूमिका खेल्दछ र देशको आर्थिक विकासमा सहायक हुने छ। कोदो उत्पादन गर्दा, नेपाली किसानहरूले नैतिक तथा आर्थिक रूपमा उनलाई प्राप्त गरेको आय तथा अन्य सामाजिक सुविधाहरूमा वृद्धि गराउँछन्।कोदो खेती का लागि सही मिट्टी, पानी, उर्वरक और बीज का चयन महत्वपूर्ण होता है। उच्च गुणवत्ता वाले बीजों का चयन और उन्नत तकनीकों का उपयोग करके किसान कोदो की उत्पादन कर सकते हैं जो उत्पादनता में वृद्धि करता है। कोदो की खेती नेपाल में विभिन्न भागों में की जाती है और यह अनेक प्रकार की आधुनिक तकनीकों का उपयोग करती है, जिससे किसानों को अधिक मुनाफा कमाने में मदद मिलती है।कोदो की खेती नेपाल में कृषि उत्पादन के लिए महत्वपूर्ण स्रोत मानी जाती है जो उत्पादन और आर्थिक स्थिरता को सुनिश्चित करती है। यह न केवल भोजन की सुरक्षा और आर्थिक स्थिरता को सुनिश्चित करती है, बल्कि किसानों को निर्धारित आय प्रदान करने के साथ-साथ कृषि संबंधी अन्य उत्पादों की आपूर्ति में भी मदद करती है। इसके अलावा, कोदो की खेती नेपाली किसानों के लिए नई रोजगार के अवसर प्रदान करती है, जो प्रगति के लिए एक महत्वपूर्ण कदम है। कोदो की खेती नेपाल के लिए एक महत्वपूर्ण स्रोत है जो उसके आर्थिक और सामाजिक विकास में महत्वपूर्ण भूमिका निभाता ह।',
  },
  {
    'name': "धान खेति\n  प्रबिधि",
    'nam': "धान खेति प्रबिधि",
    'imagepath': "assets/dhan1.png",
    'description': 'धान कृषि नेपालको कृषि सेक्टरमा एक महत्वपूर्ण भूमिका खेल्दछ। यसले नेपाली किसानहरूलाई आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। धान नेपालको प्रमुख अन्न फसल मानिन्छ र यसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।धान की खेती के लिए सही जलवायु, भूमि, और पोषक तत्वों का सही संरचना करना महत्वपूर्ण होता है। यह फसल अधिकतर नेपालको मध्य तथा पहाड़ी क्षेत्रहरूमा उत्पादन हुन्छ। धान की खेती वर्षभर कठिनाईहरूको साथ गरी विविधतामय भूमिको में की जाती है, यहाँ तापमान, भूमि प्रकार, र अन्य घातक कारकहरू ध्यानमा राख्नु पर्छ।धान की खेती नेपाली किसानहरूलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्छ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ। धान की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ',
  }
];

List<Map> Uchha = [
  {
    'name': "कफी खेति\n  प्रबिधि ",
    'nam': "कफी खेति प्रबिधि ",
    'imagepath': "assets/kafi.png",
    'description':'काफी कृषि नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपाली किसानहरूले आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। काफी नेपालको प्रमुख अन्न फसल मानिन्छ र यसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।काफी की खेती के लिए सही जलवायु, भूमि, और पोषक तत्वों का सही संरचना करना महत्वपूर्ण होता है। यह फसल अधिकतर नेपालको मध्य तथा पहाड़ी क्षेत्रहरूमा उत्पादन हुन्छ। काफी की खेती वर्षभर कठिनाईहरूको साथ गरी विविधतामय भूमिको में की जाती है, यहाँ तापमान, भूमि प्रकार, र अन्य घातक कारकहरू ध्यानमा राख्नु पर्छ।काफी की खेती नेपाली किसानहरूलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्छ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ। काफी की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  },
  {
    'name': "च्याउ खेति \n  प्रबिधि ",
    'nam': "च्याउ खेति प्रबिधि ",
    'imagepath': "assets/mushh.png",
    'description':'काफी कृषि नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपाली किसानहरूले आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। काफी नेपालको प्रमुख अन्न फसल मानिन्छ र यसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।काफी की खेती के लिए सही जलवायु, भूमि, और पोषक तत्वों का सही संरचना करना महत्वपूर्ण होता है। यह फसल अधिकतर नेपालको मध्य तथा पहाड़ी क्षेत्रहरूमा उत्पादन हुन्छ। काफी की खेती वर्षभर कठिनाईहरूको साथ गरी विविधतामय भूमिको में की जाती है, यहाँ तापमान, भूमि प्रकार, र अन्य घातक कारकहरू ध्यानमा राख्नु पर्छ।काफी की खेती नेपाली किसानहरूलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्छ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ। काफी की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  }
];

List<Map> tarkari = [
  {
    'name': "काउली खेति\n  प्रबिधि",
    'nam': "काउली खेति प्रबिधि",
    'imagepath': "assets/cauli.png",
    'description':'काउली कृषि नेपालको मुख्य अन्नफसलहरूमा सेरो रुपमा गण्ड्रीय वर्गमा आउने एक महत्वपूर्ण फसल हो। यसले नेपालको खाद्य सुरक्षा तथा आर्थिक विकासमा महत्वपूर्ण भूमिका निभाउँछ।काउली की खेती के लिए उपयुक्त मिट्टी, समयबद्ध नियोजन, उपयुक्त पोषण तत्व, उच्च गुणवत्ता वाले बीज, र सबदैला प्रकारका काउली विधानहरूको उपयोग गर्नु पर्छ। काउली खेती प्रायः सितामा खेती गरिन्छ, तर यो विधान अन्य ऋतुमा पनि गर्न सकिन्छ।काउली की खेती नेपाली किसानहरूलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्छ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ। काउली की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  },
  {
    'name': "बन्दा खेति\n  प्रबिधि ",
    'nam': "बन्दा खेति प्रबिधि ",
    'imagepath': "assets/cabbage.png",
    'description':'बन्दा कृषि नेपालको मुख्य अन्नफसलहरूमा सम्मिलित अन्नफसलका रूपमा आउने एक महत्वपूर्ण फसल हो। यो बालीका स्वरुपमा हुने फसल छ जसले उत्पादन र सेवा प्रदान गर्दा समुचित उपज गर्न सक्छ र उपजाउन अन्य फसलहरूको लागि सहायक रूपमा पनि काम गर्छ।बन्दा की खेती के लिए उपयुक्त मिट्टी, समयबद्ध नियोजन, उपयुक्त पोषण तत्व, र उच्च गुणवत्ता वाले बीजका उपयोग को लागि समर्थ कृषकहरूको आवश्यकता छ। बन्दा खेतीले कृषकलाई आर्थिक रूपमा प्रभावकारी बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्न मद्दत गर्दछ।बन्दा की खेती नेपालको खाद्य सुरक्षा तथा आर्थिक विकासमा महत्वपूर्ण भूमिका निभाउँछ। यसले नेपाली किसानहरूलाई आर्थिक रूपमा सशक्त बनाउँछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ। बन्दा की खेतीले राष्ट्रिय खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण योगदान प्रदान गर्दछ र राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  },
  {
    'name': "ब्रोकाउली खेति\n  प्रबिधि",
    'nam': "ब्रोकाउली खेति प्रबिधि",
    'imagepath': "assets/brokauli.png",
    'description':'ब्रोकाउली कृषि नेपालको कृषि सेक्टरमा एक महत्वपूर्ण अन्नफसल हो। यसले नेपाली किसानहरूलाई आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। ब्रोकाउली नेपालको प्रमुख अन्न फसलहरूमा सम्मिलित अन्नफसलको रूपमा आउने फसल हो जसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।ब्रोकाउली की खेती के लिए उपयुक्त मिट्टी, समयबद्ध नियोजन, उपयुक्त पोषण तत्व, उच्च गुणवत्ता वाले बीज, र सबदैला प्रकारका ब्रोकाउली विधानहरूको उपयोग गर्नु पर्छ। ब्रोकाउली खेतीले कृषकलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्दछ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ।ब्रोकाउली की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका निभाउँछ। यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ। ब्रोकाउली की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  },
  {
    'name': "आलु  खेति \n  प्रबिधि ",
    'nam': "आलु  खेति  प्रबिधि ",
    'imagepath': "assets/aalu.png",
    'description':'आलु कृषि नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपाली किसानहरूलाई आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। आलु नेपालको प्रमुख अन्न फसलहरूमा सम्मिलित अन्नफसलको रूपमा आउने फसल हो जसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।आलु की खेती के लिए उपयुक्त मिट्टी, समयबद्ध नियोजन, उपयुक्त पोषण तत्व, उच्च गुणवत्ता वाले बीज, र सबदैला प्रकारका आलु विधानहरूको उपयोग गर्नु पर्छ। आलु खेती नेपालको प्रमुख कृषि उत्पादक जिलाहरूमा अत्यधिक उत्पादन हुने फसलमा समाहित गरिन्छ। यसले नेपालको अर्थिक संरचनामा महत्वपूर्ण योगदान प्रदान गर्दछ र राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।आलु की खेती नेपाली किसानहरूलाई आर्थिक रूपमा सशक्त बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मद्दत गर्दछ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ। आलु की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थ'
  },
  {
    'name': "मुला खेति\n  प्रबिधि",
    'nam': "मुला खेति प्रबिधि",
    'imagepath': "assets/mula.png",
    'description':'मूला कृषि नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपाली किसानहरूलाई आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। मूला नेपालको प्रमुख अन्न फसलहरूमा सम्मिलित अन्नफसलको रूपमा आउने फसल हो जसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।मूला की खेती के लिए उपयुक्त मिट्टी, समयबद्ध नियोजन, उपयुक्त पोषण तत्व, उच्च गुणवत्ता वाले बीज, र सबदैला प्रकारका मूला विधानहरूको उपयोग गर्नु पर्छ। मूला खेतीले कृषकलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्दछ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ।मूला की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका निभाउँछ। यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ र राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण योगदान प्रदान गर्दछ। यसले नेपाली किसानहरूलाई आर्थिक रूपमा सशक्त बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मद्दत गर्दछ। आलु की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  },
  {
    'name': "पिडालु खेति \n  प्रबिधि",
    'nam': "पिडालु खेति प्रबिधि",
    'imagepath': "assets/pidalu.png",
    'description':'पिडालु कृषि नेपालमा एक महत्वपूर्ण खेती पद्धति हो। यसले नेपाली किसानहरूलाई आर्थिक रूपमा उनले प्राप्त गरेको आय बढ़ाउने, उत्पादनी क्षमता में वृद्धि गर्ने, र खाद्य सुरक्षा सुनिश्चित गर्ने में महत्वपूर्ण भूमिका निभाउँछ। पिडालु नेपालको प्रमुख अन्न फसलहरूमा सम्मिलित अन्नफसलको रूपमा आउने फसल हो जसले नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ।पिडालु की खेती के लिए उपयुक्त मिट्टी, समयबद्ध नियोजन, उपयुक्त पोषण तत्व, उच्च गुणवत्ता वाले बीज, र सबदैला प्रकारका पिडालु विधानहरूको उपयोग गर्नु पर्छ। पिडालु खेतीले कृषकलाई आर्थिक रूपमा मजबूत बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मदद गर्दछ। यसले उनलाई आर्थिक स्थिरता प्रदान गर्दछ र उनको आर्थिक संवर्धनमा महत्वपूर्ण भूमिका खेल्दछ।पिडालु की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका निभाउँछ। यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ र राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण योगदान प्रदान गर्दछ। यसले नेपाली किसानहरूलाई आर्थिक रूपमा सशक्त बनाउँछ र उनलाई स्वतन्त्रता प्राप्त गर्ने में मद्दत गर्दछ। पिडालु की खेती नेपालको खाद्य सुरक्षा तथा अर्थिक विकासमा महत्वपूर्ण भूमिका खेल्दछ र यसले राष्ट्रिय आर्थिक विकासमा महत्वपूर्ण साझेदारी प्रदान गर्दछ।'
  },
];

class ListPart extends StatelessWidget {
  const ListPart({super.key, required this.currentpage});
  final int currentpage;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 1,
      ),
      body: Stack(
        children: [
          Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Container(
                height: MediaQuery.of(context).size.height / 12.5,
                width: double.maxFinite,
                color: Colors.green,
                child:Row(
                  children: [
                    IconButton(onPressed: (){
                      Navigator.pop(context);
                    }, icon: Icon(Icons.arrow_back_ios_new)),
                     Center(
                    child: Text(
                  "कृषि तथा पसुपंछी सम्बन्धि आधारभूत जानकारी ",
                  style: TextStyle(
                      fontSize: MediaQuery.of(context).size.height * 0.023,
                      color: Colors.white),
                )),
                  ],
                )
              ),
              SizedBox(
                height: 30,
              ),
              Padding(
                padding: const EdgeInsets.fromLTRB(10, 0, 0, 0),
                child: Text(
                  dataList[currentpage]['nam'],
                  style: TextStyle(
                      fontSize: MediaQuery.of(context).size.height * 0.032,
                      fontWeight: FontWeight.bold),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Padding(
                padding: const EdgeInsets.fromLTRB(10, 0, 0, 0),
                child: Text(
                  "परिचय ",
                  style: TextStyle(
                      fontSize: MediaQuery.of(context).size.height * 0.025),
                ),
              ),
              SizedBox(
                height: 15,
              ),
              Padding(
                padding: const EdgeInsets.fromLTRB(13, 0, 0, 0),
                child: Column(
                  children: [
                    Container(
                      height: MediaQuery.of(context).size.height / 15,
                      width: MediaQuery.of(context).size.width / 1.08,
                      decoration: BoxDecoration(
                          color: Colors.blue[300],
                          borderRadius: BorderRadius.only(
                              topLeft: Radius.circular(13),
                              topRight: Radius.circular(13))),
                      child: Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text(
                          "परिचय ",
                          style: TextStyle(
                              fontSize:
                                  MediaQuery.of(context).size.height * 0.025,
                              fontWeight: FontWeight.bold),
                        ),
                      ),
                    ),
                  ],
                ),
              )
            ],
          ),
          Padding(
            padding: const EdgeInsets.fromLTRB(10, 250, 10, 10),
            child: Center(
              child: Container(
                  height: MediaQuery.of(context).size.height / 1.4,
                  width: MediaQuery.of(context).size.width / 1.08,
                  color: Colors.white,
                  child: SingleChildScrollView(
                    child: Column(
                      children: [
                        Text(
                          dataList[currentpage]['description'],
                          style: TextStyle(
                              fontSize:
                                  MediaQuery.of(context).size.height * 0.022),
                        )
                      ],
                    ),
                  )),
            ),
          ),
        ],
      ),
    );
  }
}
